[
  {
    "Detail_Level": {
      "label": "Detail Level",
      "value": "Low",
      "explanation": "The narration provides a very high-level overview of the baking process without specifying quantities, tools, or techniques. The instructions are concise and lack detailed step-by-step guidance."
    },
    "Personalization": {
      "label": "Personal Touch",
      "value": "None",
      "explanation": "There is no mention of personal preferences, anecdotes, or specific suggestions that would personalize the baking experience. The narration sticks to straightforward, impersonal instructions."
    },
    "Instructional_Specificity": {
      "label": "Instructional Specificity",
      "value": "General",
      "explanation": "The instructions given are general and lack specificity. No specific quantities, temperatures, or detailed techniques are provided, making the guidance quite broad and applicable in a generic sense."
    }
  },
  {
    "Detail_Level": {
      "label": "Detail Level",
      "value": "High",
      "explanation": "This narration provides clear, detailed instructions for each step of the process, specifying the use of cupcake liners and a large cookie scoop for scooping the batter. The detailed description of how to line the muffin tin and scoop the batter qualifies it as a high level of detail."
    },
    "Personalization": {
      "label": "Personal Touch",
      "value": "Medium",
      "explanation": "The narrator includes a personal preference by stating, 'I like to top my blueberry muffins with a few extra blueberries on top.' This adds a personal touch to the narration without it being centered around personal anecdotes or extensive personalization, ranking it as medium."
    },
    "Instructional_Specificity": {
      "label": "Instructional Specificity",
      "value": "Specific",
      "explanation": "The instructions are specific, guiding the viewer through each step with precise actions, such as the use of specific tools (a large cookie scoop) and the addition of extra blueberries on top of the muffins. This attention to the specifics of the cooking process defines the instructional specificity as high."
    }
  }
]