[
  {
    "id": 0,
    "content": "now that i've successfully learned how to make muffins i had to make a triple chocolate version add all the wet ingredients to a bowl and whisk until combined in another bowl add the flour cocoa powder and caster sugar and whisk these together then add your chocolate chips coating them in the flour help stop them from sinking fold the wet ingredients into the mix then refrigerate for at least one hour this helps them rise without overflowing scoop the batter into muffin cases then top with a mix of chocolate chips follow these bacon instructions and that's it enjoy ",
    "assignment": {
      "Detail_Level": {
        "label": "Detail Level",
        "value": "Low",
        "explanation": "The narration provides a straightforward list of steps and ingredients without going into specific quantities or detailed technique explanations, making it a concise guide rather than an in-depth tutorial."
      },
      "Explanation_Depth": {
        "label": "Explanation Depth",
        "value": "Minimal",
        "explanation": "The narration offers limited reasoning behind the steps taken. For instance, it mentions refrigerating the batter to prevent overflow but does not explain how or why this technique works, thus offering minimal explanation."
      },
      "Personalization": {
        "label": "Personalization",
        "value": "Impersonal",
        "explanation": "While there is a brief introductory statement reflecting a personal achievement, the overall narration lacks personal anecdotes, engagement, or a distinctive voice that connects with the audience on a personal level."
      },
      "Navigational_Utility": {
        "label": "Navigational Utility",
        "value": "Medium",
        "explanation": "Due to its concise format, a viewer can likely navigate through the steps without much difficulty. However, the lack of detailed explanations and distinct markers for each part of the process might make it harder for viewers to locate specific information if needed."
      }
    }
  },
  {
    "id": 1,
    "content": "Hey guys, I'm Dina from simplyhomecooked.com and today I'll be showing you how to make these fluffy and moist blueberry muffins They are loaded with a ton of blueberries and they're topped with a simple and delicious brown sugar streusel So you want to start off by combining all of your dry ingredients So in a large bowl combine two cups of all-purpose flour, a teaspoon of baking powder, half a teaspoon of baking soda, and a quarter teaspoon of salt Then whisk it all together and reserve one tablespoon of that flour mixture Now mix that reserve tablespoon of the flour mixture with one-and-a-half cups of fresh blueberries The reason why we add that little tiny bit of flour to those blueberries is when we add them to the batter During baking the blueberries don't sink as fast when they're coated in flour Now add three eggs into a large bowl and whisk them on high speed using an electric mixer You want to do this for about three minutes until the eggs become fluffy and pale Then continue beating the eggs as you slowly add one cup of granulated sugar You'll want to keep beating those eggs for about three more minutes So the key to really fluffy muffins is well beaten eggs Now you want to add a teaspoon of vanilla extract and a tablespoon of fresh lemon juice Now continue beating the egg mixture as you slowly add 3/4 cups of heavy cream Now you can begin adding your dry ingredients, but don't do it all at once So get a sifter out and then add about a third of that flour mixture at a time with mixing in between Once you've got all of your dry ingredients well combined into the muffin batter Continue beating with your electric mixer as you slowly gradually add in four tablespoons of melted unsalted butter All right Now the last and final step is adding in those blueberries and at this point you want to fold it in with a spatula Now line your muffin tin with cupcake liners and begin scooping the batter out using a large cookie scoop. I Like to top my blueberry muffins with a few extra blueberries on top, but that's totally optional And before the muffins go into the oven you want to make that simple streusel. In a small bowl combine a 1 tablespoon of unsalted cold cubed butter, 2 tablespoons of all-purpose flour, a pinch of salt, a teaspoon of cinnamon, and 3 tablespoons of brown sugar Mash that all together using a fork until the ingredients are well combined and they have a crumbly texture to them Now top the blueberry muffins with the streusel topping and bake them in the oven at 350 degrees Fahrenheit for about 35 minutes I hope you guys enjoyed watching this video and if you did, please be sure to share it, like and subscribe to our channel So you guys never miss out on any of our new recipes. See you next time ",
    "assignment": {
      "Detail_Level": {
        "label": "Detail Level",
        "value": "High",
        "explanation": "The narration provides a thorough breakdown of ingredients and steps, such as specifying the amounts, detailing the process of combining ingredients, and explaining the purpose behind certain techniques like coating blueberries in flour to prevent sinking."
      },
      "Explanation_Depth": {
        "label": "Explanation Depth",
        "value": "Extensive",
        "explanation": "There's a significant amount of detail explaining why certain steps are essential, like the importance of well-beaten eggs for fluffiness and why dry ingredients should be added gradually. This helps viewers understand not just what to do but why they're doing it."
      },
      "Personalization": {
        "label": "Personalization",
        "value": "Personalized",
        "explanation": "The narration begins with a personal introduction and contains several personal touches throughout, such as Dina's preference for topping the muffins with extra blueberries and her invitation to the audience to share, like, and subscribe, making the video more engaging and relatable."
      },
      "Navigational_Utility": {
        "label": "Navigational Utility",
        "value": "High",
        "explanation": "The detailed, sequence-oriented presentation of information, combined with the personal and engaging style of narration, makes it easier for viewers to follow along and return to specific points in the video for clarification or to revisit certain steps."
      }
    }
  }
]