{
  "0": {
    "Step1": {
      "content": "first off set that oven to 425 degrees fahrenheit we want a really high blast of heat when these go in because that'll set the edge and let them rise up so you'll have a nice bakery style dome on top if you did 350 they would spread out and it just wouldn't be the right kind of muffin",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "High",
          "explanation": "This narration provides specific instructions on oven temperature and the reasoning behind it, showing a high level of detail regarding how to achieve a desired muffin texture."
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "In-depth",
          "explanation": "The narrative goes beyond basic instructions, explaining the science behind the oven temperature setting and its effect on the muffin's structure, providing an in-depth understanding of the baking process."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "Low",
          "explanation": "While the narration shares a specific technique for achieving a bakery-style muffin, it lacks personal anecdotes, direct audience engagement, or personalized commentary, making it low in personalization."
        }
      }
    },
    "Step2": {
      "content": "into my bowl and i'm using a sifter here i'm adding in two and three quarter cups that is 330 grams of all-purpose flour one teaspoon of salt and that might seem like a lot but do you want some contrast to all that chocolate and the sugar so it'll really like amp the flavor up and let you appreciate what's going on in the muffin for leavening i'm using one tablespoon of baking powder and again it's kind of a lot of leavening agent but this is how you get that bakery style top sift it out we're done with that scale and get set aside as well give it a quick whisk now we can set it aside",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "High",
          "explanation": "This narration provides detailed measurements in both cups and grams, uses specific equipment like a sifter, and elaborates on the quantity of ingredients used. The detail in the process, including the use of a scale and the instruction to sift and whisk, further supports the high level of detail."
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "In-depth",
          "explanation": "The narrator explains the purpose behind using a seemingly high amount of salt and baking powder, tying these choices to the desired outcome of flavor contrast and achieving a bakery-style top on the muffins. This depth of explanation helps the viewer understand the reasoning behind specific steps and ingredient quantities."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "Medium",
          "explanation": "While the narration includes some insights into the narrator's reasoning and preferences, such as wanting contrast in flavors and a specific muffin top, it does not delve into personal anecdotes or direct engagement with the audience. The mention of 'amp the flavor up' and a personal take on the amount of leavening agent suggests a medium level of personalization."
        }
      }
    },
    "Step3": {
      "content": "this was melted a minute ago it already cooled down i'm going to put it into the microwave for the wet ingredients it's important that you're dealing with room temperature things and if it gets cold we're going to warm it up in the microwave and ps it's going to get cold this counter is freezing all right 300 ml or 1 4 cups of whole milk in yoga half a cup or 113 grams of unsalted butter that's been melted and get it all out there so by the by today is the first time ever in the history of preppy kitchen that brian is filming you wanna say hi no he's eating cookies that i made one cup or 200 grams of sugar right in that bowl let's give it a whisk to bring it together if you notice some clumps of butter happen when you mix it all together pop it into the microwave for 40 seconds and it should be totally fine i used warm milk so it's not happening to me so right now we're gonna add in the eggs and the sour cream two large eggs one two as well as one quarter cup of sour cream and if you don't have that you can go ahead and use full fat plain yogurt it'll be completely delicious still this is optional but i am adding one tablespoon of vanilla that's 15 ml",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "High",
          "explanation": "The narration provides specific measurements for ingredients (e.g., 300 ml of whole milk, 113 grams of unsalted butter, 200 grams of sugar), details on handling the ingredients (e.g., warming up the butter if it cools down), and alternative ingredient options (e.g., using full-fat plain yogurt instead of sour cream), demonstrating a high level of detail."
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "In-depth",
          "explanation": "The narration explains the importance of ingredient temperatures, provides a solution for butter clumps, and offers a rationale for ingredient choices, such as using warm milk to avoid clumping and suggesting alternatives for sour cream. This level of explanation helps viewers understand not just what to do but why, indicating in-depth explanation."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "High",
          "explanation": "The narrator shares a personal anecdote about it being the first time 'Brian' is filming, mentions the counter being cold, and personally addresses the viewers with options for ingredient substitutions. The inclusion of these personal touches and direct engagement with the audience indicates a high level of personalization."
        }
      }
    },
    "Step4": {
      "content": "now it's time to pour the wet into the dry give it a whisk and take it to almost combined you could have a couple clumps of like flour hanging out here and there because we'll do more mixing once those chocolate chips go in so you can see we have a couple clumps here and there but it's no big deal",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "High",
          "explanation": "The narration provides specific instructions on combining wet and dry ingredients, mentions the expected texture, and anticipates the addition of chocolate chips, indicating a high level of detail."
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "In-depth",
          "explanation": "The narrator explains the reasoning behind not fully mixing the batter until the chocolate chips are added and reassures that having some clumps is acceptable, showing an in-depth explanation of the process."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "Medium",
          "explanation": "The casual mention of 'you could have a couple clumps of like flour hanging out here and there' adds a touch of personalization by sharing a relaxed approach to the mixing process, though it lacks a direct personal anecdote or story."
        }
      }
    },
    "Step5": {
      "content": "it's time for some chocolate the best part all right in my recipe i specify one and a half cups of semi-sweet chocolate but i'm living large and using one cup of semi-sweet and half a cup of bittersweet you could even use milk chocolate if that's what you prefer here we go that's the bittersweet chocolate and i'm taking a handful of the semi-sweet chips and reserving them because i'll be sprinkling them on top for beauty purposes rest of the chocolate chips go in and you should fold them in with a spatula not use a whisk",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "High",
          "explanation": "The narration provides specific measurements for different types of chocolate and describes the process in detail, including the step of reserving some chocolate chips for topping. This level of granularity in describing the ingredient proportions and handling instructions indicates a high detail level."
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "In-depth",
          "explanation": "The narrator explains the rationale behind the choice of chocolate types, aiming for a balance of flavors and textures, and the purpose of reserving some chocolate chips for aesthetic reasons. This goes beyond mere instruction, offering insight into the decision-making process, which is characteristic of an in-depth explanation."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "High",
          "explanation": "The inclusion of personal preferences ('I'm living large'), suggestions for ingredient variations based on the viewer's taste, and the casual, conversational tone ('the best part') all contribute to a high level of personalization. This approach makes the content more engaging and relatable."
        }
      }
    },
    "Step6": {
      "content": "i'm doing it two different ways so you can see the difference between a naked muffin and one that's in the paper it's gonna be different i've buttered and floured half of the muffin tins so you can see just a nice cut of butter good dash of flour move all that flour around and then dump out the excess all right and for the rest i'm going to use muffin papers which go a bit higher so you won't have that like mushroom shaped muffin top but they should still rise up with a nice dome",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "High",
          "explanation": "The narration provides extensive details on preparing the muffin tins with butter and flour, and using muffin papers, including the technique of moving the flour around and dumping out the excess. It also discusses the expected outcomes of each method, indicating a high level of detail."
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "In-depth",
          "explanation": "The narrator explains the reason behind using two different methods for preparing the muffin tins and the expected results (avoiding a 'mushroom' shaped top and achieving a nice dome), providing viewers with understanding beyond the immediate steps."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "High",
          "explanation": "This narrative includes a personalized approach by showing two different preparation methods based on the narrator's experience and preference. The casual and inclusive language ('I'm doing it two different ways so you can see') also adds a personal touch, making the content more relatable and engaging."
        }
      }
    },
    "Step7": {
      "content": "i'm using a large ice cream scooper to transfer my batter into the muffin tin and i want to fill it up all the way normally it's two-thirds of the way high for cupcakes but this time it's full to the brim okay fill those papers up and when you're doing that try to be careful about getting like batter on the edges it'll burn it's just a matter of how it looks it'll still bake fine when you're scooping the batter it's a nice time to kind of monitor the chocolate chips and make sure that no one is getting a sad amount you want to have an equal distribution so if you notice that your scoop didn't get any chips scoop up some chips after the batter goes in",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "High",
          "explanation": "The narration provides specific details about using a large ice cream scooper, filling the muffin tin to the brim, and carefully distributing chocolate chips to ensure even distribution. These details offer clear guidance on how to perform each step."
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "In-depth",
          "explanation": "The narrator explains the reasoning behind filling the muffin cups to the brim instead of the usual two-thirds for cupcakes, and the importance of even distribution of chocolate chips. This depth helps the viewer understand the impact of these actions on the final product."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "High",
          "explanation": "The use of phrases like 'it's just a matter of how it looks,' and 'it's a nice time to kind of monitor' adds a personal touch to the narration, making it feel like direct advice from an experienced friend or chef."
        }
      }
    },
    "Step8": {
      "content": "this recipe makes exactly 12 big muffins and now it's time to go into the oven you need to have a high heat to lock in the edge so it gets set and then the top can burst through to create that big bakery style dome this is gonna go into the oven at 425 fahrenheit for five minutes then we'll reduce the temperature to 350 and bake for 20 to 25 minutes depending you want to have a nice golden top that's set in the middle so you can insert a skewer through the center and it'll come out clean except for all that molten chocolate",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "High",
          "explanation": "This narration provides precise oven temperatures, baking times, and a clear description of the desired outcome (e.g., 'big bakery style dome'), indicating a high level of detail."
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "In-depth",
          "explanation": "The narration explains the purpose behind the initial high oven temperature and its role in achieving the muffin's texture and appearance, showcasing an in-depth explanation of the baking process."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "Low",
          "explanation": "While the narration is detailed and informative, it lacks personal anecdotes, preferences, or direct audience engagement, thus fitting a low personalization value."
        }
      }
    },
    "Step9": {
      "content": "out of the oven and cooled just enough touch i want to show you the difference between the in paper versus the out of paper out of paper so nice crisp edge muffin over a little bit and golden brown in the paper the paper really guided it up so it's a little bit taller and the difference is that you don't have that crisp edge it's really like soft all over and just delicious you've got to take a look at the inside of this",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "High",
          "explanation": "The narration provides detailed observations about the differences in texture and appearance between muffins baked in paper versus those not, including specific descriptions of the edges and overall texture."
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "Moderate",
          "explanation": "While the narration explains the observable differences between the two methods of baking muffins, it does not delve deeply into the scientific or technical reasons why these differences occur, offering a practical rather than an in-depth theoretical explanation."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "High",
          "explanation": "The narrator shares a personal preference and invites the viewer to take a closer look, making the content feel more engaging and personalized through the direct address and the sharing of their own observations and preferences."
        }
      }
    }
  },
  "3": {
    "Step1": {
      "content": "Start by preheating your oven to 425 degrees Fahrenheit.",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "Low",
          "explanation": "The narration provides a very basic instruction without any additional detail about the purpose or the specific outcomes of preheating the oven to that temperature."
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "Minimal",
          "explanation": "There is no explanation provided about why the oven should be preheated to 425 degrees Fahrenheit, such as how it affects the baking process or the final product."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "Low",
          "explanation": "The narration lacks any personal anecdotes, preferences, or direct engagement with the audience, making it strictly instructional."
        }
      }
    },
    "Step2": {
      "content": "You'll also need 2 teaspoons of baking powder, and 1/2 teaspoon of salt. This is also the point where you'd add in any spices like cinnamon or pumpkin pie spice. We're gonna give this a quick mix just to combine, about 10 seconds.",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "Medium",
          "explanation": "The narration provides specific measurements for ingredients and mentions the addition of optional spices, offering a moderate level of detail without extensive elaboration on techniques or the purpose of each ingredient."
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "Minimal",
          "explanation": "While the narration specifies what ingredients to add and a general action (quick mix), it does not delve into why these specific measurements or ingredients are used, nor does it explain the impact of adding spices beyond suggesting their inclusion."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "Medium",
          "explanation": "The suggestion to add 'any spices like cinnamon or pumpkin pie spice' offers a moderate level of personalization, allowing viewers to customize the recipe to their taste preferences, but it lacks direct personal anecdotes or a strong individual perspective."
        }
      }
    },
    "Step3": {
      "content": "The batter starts with 1/2 cup of softened salted butter, and 1 cup of granulated sugar. We're going to use a hand mixer to cream this together. At first this mixture will be lumpy, but keep on mixing for about 2 minutes. After 2 minutes your sugar and butter will be well combined, and it'll be a smooth, paste-like, creamy consistency. Then you'll add in 2 large eggs, and mix this briefly until just combined, about 30 seconds. Then I'm going to add in 1 teaspoon of vanilla extract, or you can use other flavors of extract, like almond extract, orange extract, lemon extract.",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "High",
          "explanation": "The narration provides explicit instructions on the process of creaming butter and sugar, including the expected consistency and specific mixing times. It also details the process of adding eggs and extract, offering alternatives for flavoring, which indicates a high level of detail in guiding the viewer through the recipe steps."
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "Moderate",
          "explanation": "While the narration offers a clear step-by-step process, it moderately explains the 'why' behind the steps (e.g., achieving a smooth, paste-like consistency). However, it doesn't delve deeply into the science or reasoning behind each ingredient's role or why certain times are specified for mixing, placing it in the moderate category."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "Medium",
          "explanation": "The narrator introduces an element of personalization by suggesting alternative flavors of extract based on the viewer's preference, indicating a moderate level of personalization. However, the narration lacks more personal anecdotes or stories that would categorize it as highly personalized."
        }
      }
    },
    "Step4": {
      "content": "Now at this point it's time to ditch our hand mixer and grab a rubber spatula. Add in half of your all-purpose flour. You're going to use 2 cups total, so you're going to add in 1 cup right now. Then use the rubber spatula to stir this in. Once all those white specks of flour start to disappear, you'll pour in 1/2 cup of either milk or buttermilk. And you'll stir this in as well until it's well combined. Last you'll add in the remaining 1 cup of all-purpose flour.",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "High",
          "explanation": "This narration provides specific quantities of ingredients and a detailed description of the process for combining them. It outlines the sequence of adding flour, the exact amount to use, and how to integrate milk or buttermilk, making it clear and easy to follow for the viewer."
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "Moderate",
          "explanation": "While the narration explains the step-by-step process, it does not delve into the reasoning behind the method of adding flour in two parts or why milk or buttermilk should be added at a particular stage. It focuses on the 'how' more than the 'why,' providing a moderate level of explanation depth."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "Medium",
          "explanation": "The instruction to 'ditch our hand mixer and grab a rubber spatula' adds a touch of personalization, suggesting a more conversational tone and implying a shared experience. However, it lacks personal anecdotes or direct engagement that would elevate it to a high level of personalization."
        }
      }
    },
    "Step5": {
      "content": "Now if you're gonna add anything into your muffins, like dried fruit, chocolate chips, or berries, now would be the time to do so.",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "Low",
          "explanation": "The narration provides a general suggestion for adding extras to the muffins without specifying quantities, types, or the method of incorporating these additions."
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "Minimal",
          "explanation": "The narration does not explain why this is the optimal time to add such ingredients, nor does it detail the impact these additions might have on the texture or flavor of the muffins."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "Medium",
          "explanation": "The narration offers a choice to the viewer, suggesting a range of ingredients that can be added to customize the muffins. This implies a degree of personal preference but does not delve into personal anecdotes or specific recommendations."
        }
      }
    },
    "Step6": {
      "content": "Then line a 12 cup muffin tin with paper baking cups. Then I like to give mine just a spritz of nonstick cooking spray, right on those paper baking cups, to prevent the muffins from sticking.",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "Medium",
          "explanation": "The narration provides a clear step of lining the muffin tin and then goes a step further to suggest spraying the paper cups with nonstick spray. It's more detailed than simply stating to prepare the tin, but it doesn't go into the granularity of why this brand of spray or that type of paper cup might be best."
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "Moderate",
          "explanation": "The narration briefly explains the purpose of using nonstick cooking spray on the paper cups—to prevent sticking. It provides a rationale for the action, which is more than a minimal explanation, but it doesn't delve into the science of nonstick sprays or alternative methods for those who might not have spray."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "High",
          "explanation": "The use of 'I like to give mine just a spritz' adds a personal touch to the narration, indicating a personal preference and practice. This direct mention of the narrator's own habit introduces a level of personalization not found in more straightforward instructional content."
        }
      }
    },
    "Step7": {
      "content": "We're gonna divide the batter up amongst our 12 muffin cups, and you should fill each one about 2/3 of the way full.",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "Medium",
          "explanation": "The narration provides a specific guideline on how much to fill the muffin cups, which is more detailed than simply instructing to fill the cups, but does not delve into precise measurements or techniques for achieving this."
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "Minimal",
          "explanation": "While the narration does give a specific instruction regarding how full to fill the muffin cups, it does not explain why this amount is optimal or what effect it will have on the muffins' baking process or final appearance."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "Low",
          "explanation": "The narration sticks to straightforward instruction without incorporating any personal anecdotes, preferences, or direct engagement with the audience."
        }
      }
    },
    "Step8": {
      "content": "Bake your muffins in the 425 degree oven for 7 minutes. After 7 minutes reduce the temperature on your oven to 350 degrees without opening the oven door. Continue baking for 12-15 minutes, and watch them carefully, as the cooking time will vary a little bit depending on your oven.",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "High",
          "explanation": "The narration provides specific temperatures, time frames, and a procedural step (not opening the oven door) that are crucial for achieving the desired outcome, indicating a high level of detail."
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "Moderate",
          "explanation": "While the narration specifies what to do and provides a general warning to watch the muffins carefully, it does not explain why these specific temperatures and times are necessary for the recipe, hence it's moderate rather than in-depth."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "Low",
          "explanation": "The narration strictly focuses on the baking process without incorporating any personal anecdotes, preferences, or direct engagement with the audience, making it low in personalization."
        }
      }
    },
    "Step10": {
      "content": "One fun topping you can experiment with is sprinkling on about 1 teaspoon of granulated sugar on top of your muffins. This gives it a nice little crunchy sweet top.",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "Low",
          "explanation": "The narration provides a simple suggestion for a topping without going into detailed instruction or specifying quantities beyond 'about 1 teaspoon.'"
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "Minimal",
          "explanation": "While the narration suggests adding granulated sugar for a crunchy top, it does not delve into why this creates a crunchy texture or how it might affect the overall muffin."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "Medium",
          "explanation": "The suggestion to add granulated sugar for a crunchy top introduces an element of personal choice and experimentation, making it somewhat personalized but not including personal anecdotes or direct engagement."
        }
      }
    }
  },
  "4": {
    "Step1": {
      "content": "then baking a preheated oven for 22 and a half minutes",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "Low",
          "explanation": "The narration provides a specific baking time but lacks detail on temperature settings, preparation steps, or reasons behind the chosen time, making it sparse in detail."
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "Minimal",
          "explanation": "It states a baking duration without offering any rationale or deeper explanation about why this specific time is necessary or how it impacts the baking process."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "Low",
          "explanation": "The narration is straightforward and focused solely on the task, without any personal anecdotes, suggestions, or engagement with the audience."
        }
      }
    },
    "Step2": {
      "content": "now sifting the flour with baking powder and a pinch of salt",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "Low",
          "explanation": "The narration provides a basic instruction without going into specifics about measurements or why these ingredients are being sifted together."
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "Minimal",
          "explanation": "There is no explanation provided about the purpose or the effect of sifting these ingredients together, only the action itself is mentioned."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "Low",
          "explanation": "The narration strictly sticks to the procedure without adding any personal touch, anecdotes, or suggestions for variations."
        }
      }
    },
    "Step3": {
      "content": "to a large mixing bowl add grated lemon zest a milk of choice we're using soy milk sugar a neutral vegetable oil and vanilla extract we squel until the ingredients are well combined",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "Medium",
          "explanation": "The narration provides a clear list of ingredients to be added to the mixing bowl but does not specify quantities or detailed descriptions of each component, striking a balance between detail and brevity."
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "Minimal",
          "explanation": "While the narration mentions the combination of ingredients, it lacks any explanation about why these particular ingredients are chosen or how they contribute to the overall dish, focusing instead on the action of mixing them."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "Medium",
          "explanation": "The mention of 'a milk of choice' and specifying 'we're using soy milk' introduces an element of personal preference and suggestion, indicating a degree of personalization without delving into personal anecdotes or stories."
        }
      }
    },
    "Step4": {
      "content": "whisk wet and dry ingredients for a short minute until lumps are gone but without over mixing",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "Low",
          "explanation": "The narration provides a very basic overview of the action required (whisking wet and dry ingredients) without going into specifics about ingredient quantities, temperatures, or specific techniques."
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "Minimal",
          "explanation": "While the narration mentions not to overmix to avoid developing lumps, it does not delve into the reasons why overmixing can negatively affect the outcome, such as impacting the texture of the final product."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "Low",
          "explanation": "The narration sticks strictly to the instructions without adding personal anecdotes, preferences, or suggestions for variations. It's a straightforward directive with no personal touch."
        }
      }
    },
    "Step5": {
      "content": "rinse the blueberries shake the water off then add them to a bowl toss them with a cornstarch and add them to the batter stir and fold the blueberries in the mixture gently",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "Medium",
          "explanation": "The narration provides a clear sequence of actions for preparing the blueberries with a mention of using cornstarch, which adds a moderate level of detail regarding the preparation process."
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "Minimal",
          "explanation": "While the narration instructs to toss the blueberries with cornstarch before adding them to the batter, it does not explain why this step is important, such as its role in preventing the berries from sinking."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "Low",
          "explanation": "The narration focuses solely on the steps to incorporate blueberries into the batter without any personal anecdotes, preferences, or direct engagement with the audience."
        }
      }
    },
    "Step7": {
      "content": "transfer the batter to the muffin liners you should be able to make 12 muffins you can fill them almost to the top",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "Medium",
          "explanation": "The narration provides a specific number of muffins that can be made and suggests filling the liners almost to the top, offering a moderate level of detail without going into precise measurements or techniques."
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "Minimal",
          "explanation": "The narration does not explain why the batter should be filled almost to the top or the impact of doing so on the final product, lacking in-depth reasoning behind the step."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "Low",
          "explanation": "This narration sticks to the instructions without including any personal anecdotes, preferences, or direct engagement with the audience, making it low in personalization."
        }
      }
    },
    "Step8": {
      "content": "then baking a preheated oven for 22 and a half minutes or until a toothpick inserted in the center comes out dry",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "Medium",
          "explanation": "The narration provides a specific baking time and a method to check doneness (toothpick test), which is more detailed than simply stating a baking time but doesn't include highly detailed instructions on temperature adjustments or placement in the oven."
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "Minimal",
          "explanation": "While the narration mentions a method for checking if the bake is done (toothpick test), it doesn't explain why 22 and a half minutes is the chosen time or why the toothpick test is a reliable method, focusing more on what to do rather than why."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "Low",
          "explanation": "The narration sticks directly to the baking instructions without incorporating any personal anecdotes, preferences, or direct engagement with the audience, making it strictly informational."
        }
      }
    },
    "Step9": {
      "content": "now let them cool down for about 30 minutes",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "Low",
          "explanation": "The narration provides a straightforward instruction without going into specifics about the cooling process, environment, or reasons why 30 minutes is the chosen time."
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "Minimal",
          "explanation": "There's no explanation provided about why the cooling period is necessary or how it affects the final product, making the depth of explanation minimal."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "Low",
          "explanation": "The instruction is very generic with no personal anecdotes, preferences, or direct engagement with the audience, resulting in a low level of personalization."
        }
      }
    }
  },
  "1": {
    "Step2": {
      "content": "in another bowl add the flour cocoa powder and caster sugar and whisk these together",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "Low",
          "explanation": "The narration provides a simple overview of the step without delving into specific measurements or detailed instructions on how to combine the ingredients, indicating a low level of detail."
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "Minimal",
          "explanation": "This narration lacks any explanation as to why these particular ingredients are combined or the effect they have on the final product, suggesting minimal explanation depth."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "Low",
          "explanation": "The narration strictly sticks to the recipe steps without including any personal anecdotes, preferences, or direct engagement with the audience, thus it falls into the low personalization category."
        }
      }
    },
    "Step3": {
      "content": "add all the wet ingredients to a bowl and whisk until combined",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "Low",
          "explanation": "The narration provides a very general instruction without specifying the types or amounts of wet ingredients, nor does it detail the technique for whisking, making it low in detail."
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "Minimal",
          "explanation": "There is no reasoning or explanation provided for why the wet ingredients need to be combined in this manner, making the explanation depth minimal."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "Low",
          "explanation": "The narration does not include any personal anecdotes, preferences, or direct engagement with the audience, resulting in low personalization."
        }
      }
    },
    "Step4": {
      "content": "fold the wet ingredients into the mix",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "Low",
          "explanation": "The narration provides a very brief instruction without delving into specifics such as how to fold effectively or why it's important not to overmix."
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "Minimal",
          "explanation": "There's no explanation provided about the purpose or the technique of folding, missing an opportunity to educate or provide insight into the cooking process."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "Low",
          "explanation": "The narration lacks personal anecdotes, preferences, or direct audience engagement, making it a straightforward instruction."
        }
      }
    },
    "Step5": {
      "content": "then add your chocolate chips coating them in the flour help stop them from sinking",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "Medium",
          "explanation": "This narration provides a specific technique (coating chocolate chips in flour) to prevent them from sinking in the batter, which adds a layer of detail beyond the mere inclusion of chocolate chips. However, it does not delve into precise measurements or further elaboration on the technique."
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "Moderate",
          "explanation": "The narration explains the purpose behind a specific action (coating chocolate chips in flour) to achieve a desired baking outcome (preventing chips from sinking), providing a moderate level of explanation about why this step is beneficial, but without in-depth scientific or technical reasoning."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "Low",
          "explanation": "This narration sticks to the practical advice without incorporating personal anecdotes, preferences, or direct engagement with the audience. The focus is purely on the baking technique, without any personalized commentary."
        }
      }
    },
    "Step7": {
      "content": "scoop the batter into muffin cases",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "Low",
          "explanation": "The narration provides a very brief instruction without specifying amounts, techniques, or any additional details about how to properly scoop the batter, making it a low-detail explanation."
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "Minimal",
          "explanation": "This narration lacks any reasoning or explanation behind the method of scooping the batter into muffin cases, such as why this method is preferred or any tips to ensure success."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "Low",
          "explanation": "There is no presence of personal anecdotes, preferences, suggestions, or audience engagement within this brief instruction, placing it at a low level of personalization."
        }
      }
    },
    "Step8": {
      "content": "follow these bacon instructions",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "Low",
          "explanation": "The narration provides a very succinct instruction with no specific details about temperature, timing, or preparation methods."
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "Minimal",
          "explanation": "The instruction lacks any reasoning or explanation behind the steps involved in 'following these bacon instructions,' making it minimal in terms of explanation depth."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "Low",
          "explanation": "The narration offers no personal anecdotes, preferences, or engagement with the audience, resulting in a low level of personalization."
        }
      }
    },
    "Step10": {
      "content": "then refrigerate for at least one hour this helps them rise without overflowing",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "Low",
          "explanation": "The narration provides a specific action (refrigerating the muffins) and a time frame but lacks detailed explanation on how this might affect the texture, appearance, or taste of the muffins beyond preventing overflow."
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "Moderate",
          "explanation": "While the narration does mention that refrigeration helps the muffins rise without overflowing, it does not delve into the scientific or technical reasons why this happens, offering a moderate level of explanation."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "Low",
          "explanation": "The narration sticks to a straightforward instruction without incorporating personal anecdotes, suggestions for variation, or engaging directly with the audience, resulting in a low level of personalization."
        }
      }
    }
  },
  "2": {
    "Step2": {
      "content": "So in a large bowl combine two cups of all-purpose flour, a teaspoon of baking powder, half a teaspoon of baking soda, and a quarter teaspoon of salt Then whisk it all together and reserve one tablespoon of that flour mixture",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "High",
          "explanation": "This narration provides specific measurements for the ingredients and describes the step-by-step process in detail, including reserving a portion of the flour mixture."
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "Minimal",
          "explanation": "Although the narration specifies ingredients and their quantities, it does not explain why certain amounts are used or the purpose behind reserving a tablespoon of the flour mixture."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "Low",
          "explanation": "The narration sticks strictly to the recipe without incorporating any personal anecdotes, preferences, or direct engagement with the audience."
        }
      }
    },
    "Step3": {
      "content": "Now add three eggs into a large bowl and whisk them on high speed using an electric mixer You want to do this for about three minutes until the eggs become fluffy and pale Then continue beating the eggs as you slowly add one cup of granulated sugar You'll want to keep beating those eggs for about three more minutes... Now you want to add a teaspoon of vanilla extract and a tablespoon of fresh lemon juice Now continue beating the egg mixture as you slowly add 3/4 cups of heavy cream",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "High",
          "explanation": "This narration provides a high level of detail, specifying the duration for which to beat the eggs, the amount of sugar to add, and the inclusion of both vanilla extract and lemon juice, along with their precise measurements."
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "Moderate",
          "explanation": "The narration offers some explanation for the steps, such as beating the eggs until they're fluffy and pale, which hints at the desired texture, but it doesn't delve into the reasoning behind the addition of vanilla extract, lemon juice, or why the heavy cream is added slowly."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "Low",
          "explanation": "The narration sticks closely to the recipe and method without including personal anecdotes, preferences, or direct engagement with the audience. It focuses purely on the instructional aspect."
        }
      }
    },
    "Step4": {
      "content": "Now you can begin adding your dry ingredients, but don't do it all at once So get a sifter out and then add about a third of that flour mixture at a time with mixing in between... Once you've got all of your dry ingredients well combined into the muffin batter",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "High",
          "explanation": "The narration provides specific instructions on how to incorporate the dry ingredients into the batter, including the use of a sifter and adding the flour mixture in increments, which signifies a high level of detail."
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "Moderate",
          "explanation": "While the narration specifies a technique for mixing dry ingredients, it does not elaborate on the reasoning behind adding the flour mixture in thirds or the benefits of using a sifter, making the explanation depth moderate."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "Low",
          "explanation": "The narration sticks to the procedure without including personal anecdotes, preferences, or direct engagement with the audience, indicating low personalization."
        }
      }
    },
    "Step5": {
      "content": "Now mix that reserve tablespoon of the flour mixture with one-and-a-half cups of fresh blueberries... Now the last and final step is adding in those blueberries and at this point you want to fold it in with a spatula",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "Medium",
          "explanation": "This narration provides a clear instruction on mixing blueberries with flour and the method of folding them into the batter, including specific quantities. However, it does not delve into the precise reasons behind these steps or the outcomes they aim to achieve, placing it in a middle ground of detail."
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "Moderate",
          "explanation": "The narration suggests a specific technique (folding with a spatula) and mentions reserving a tablespoon of the flour mixture for the blueberries, which hints at a purpose (likely to prevent the blueberries from sinking). While it gives a practical tip, it doesn't fully explore the rationale behind these steps, thus offering a moderate level of explanation."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "Low",
          "explanation": "The narration sticks closely to the recipe steps without including personal anecdotes, preferences, or direct audience engagement. It focuses solely on the instructions for adding blueberries to the batter, lacking in personal touch or customization options."
        }
      }
    },
    "Step6": {
      "content": "Now line your muffin tin with cupcake liners",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "Low",
          "explanation": "The narration provides a straightforward instruction without going into the specifics of why cupcake liners are used or any particular technique for lining the muffin tin."
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "Minimal",
          "explanation": "There is no reasoning or explanation provided about the purpose or benefits of using cupcake liners, making the depth of explanation minimal."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "Low",
          "explanation": "The instruction is generic with no personal anecdotes, preferences, or engagement with the audience, resulting in a low level of personalization."
        }
      }
    },
    "Step7": {
      "content": "begin scooping the batter out using a large cookie scoop. I Like to top my blueberry muffins with a few extra blueberries on top, but that's totally optional",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "Medium",
          "explanation": "The narration provides a clear instruction on how to scoop the batter, and mentions a specific technique for topping muffins, but does not go into the finer details of the process or specify quantities."
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "Moderate",
          "explanation": "The narration offers a rationale for topping muffins with blueberries, enhancing the aesthetic and possibly flavor, but doesn't delve deeply into the science or technique behind it."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "High",
          "explanation": "The mention of the narrator's personal preference for topping blueberry muffins with extra blueberries introduces a personalized touch to the narration, inviting viewers to customize the recipe to their taste."
        }
      }
    },
    "Step8": {
      "content": "bake them in the oven at 350 degrees Fahrenheit for about 35 minutes",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "Low",
          "explanation": "The narration provides a very straightforward instruction on baking temperature and time without any additional details on preparation or technique."
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "Minimal",
          "explanation": "There is no explanation provided as to why 350 degrees Fahrenheit or 35 minutes is chosen, missing the reasoning behind these specific conditions."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "Low",
          "explanation": "The narration lacks any personal touch, anecdotes, or suggestions, presenting the information in a direct and impersonal manner."
        }
      }
    },
    "Step10": {
      "content": "And before the muffins go into the oven you want to make that simple streusel. In a small bowl combine a 1 tablespoon of unsalted cold cubed butter, 2 tablespoons of all-purpose flour, a pinch of salt, a teaspoon of cinnamon, and 3 tablespoons of brown sugar Mash that all together using a fork until the ingredients are well combined and they have a crumbly texture to them Now top the blueberry muffins with the streusel topping",
      "assignment": {
        "DetailLevel": {
          "label": "Detail Level",
          "value": "High",
          "explanation": "This narration provides precise measurements and specific instructions on how to combine the ingredients for the streusel, indicating a high level of detail."
        },
        "ExplanationDepth": {
          "label": "Explanation Depth",
          "value": "Moderate",
          "explanation": "While the narration details how to make the streusel, it does not explain why each ingredient is used or why the streusel should be crumbly, offering a moderate depth of explanation."
        },
        "Personalization": {
          "label": "Personalization",
          "value": "Low",
          "explanation": "The narration sticks strictly to the recipe steps for making streusel without including any personal anecdotes, preferences, or direct engagement with the audience."
        }
      }
    }
  }
}