{
  "Step1": [
    {
      "id": 0,
      "content": "first off set that oven to 425 degrees fahrenheit we want a really high blast of heat when these go in because that'll set the edge and let them rise up so you'll have a nice bakery style dome on top if you did 350 they would spread out and it just wouldn't be the right kind of muffin",
      "label": "Preheat the Oven",
      "explanation": "This segment details the initial step of preheating the oven to a high temperature, crucial for achieving the desired muffin texture and dome."
    },
    {
      "id": 1,
      "content": "",
      "label": "Preheat the Oven",
      "explanation": "This step was not explicitly mentioned in the narration, hence left empty."
    },
    {
      "id": 2,
      "content": "",
      "label": "Preheat the Oven",
      "explanation": "The narration does not explicitly mention preheating the oven at the beginning, but it's implied before baking."
    },
    {
      "id": 3,
      "content": "Start by preheating your oven to 425 degrees Fahrenheit.",
      "label": "Preheat the Oven",
      "explanation": "This segment directly corresponds to the action of preheating the oven, a crucial initial step in baking muffins."
    },
    {
      "id": 4,
      "content": "then baking a preheated oven for 22 and a half minutes",
      "label": "Preheat the Oven",
      "explanation": "This segment indicates the oven should be preheated before baking, though the exact temperature isn't specified in this part of the narration."
    }
  ],
  "Step2": [
    {
      "id": 0,
      "content": "into my bowl and i'm using a sifter here i'm adding in two and three quarter cups that is 330 grams of all-purpose flour one teaspoon of salt and that might seem like a lot but do you want some contrast to all that chocolate and the sugar so it'll really like amp the flavor up and let you appreciate what's going on in the muffin for leavening i'm using one tablespoon of baking powder and again it's kind of a lot of leavening agent but this is how you get that bakery style top sift it out we're done with that scale and get set aside as well give it a quick whisk now we can set it aside",
      "label": "Prepare Dry Ingredients",
      "explanation": "This part of the narration explains measuring and mixing the dry ingredients, a crucial step for the muffin's foundation."
    },
    {
      "id": 1,
      "content": "in another bowl add the flour cocoa powder and caster sugar and whisk these together",
      "label": "Prepare Dry Ingredients",
      "explanation": "This segment describes the process of measuring and mixing dry ingredients together, which aligns with preparing dry ingredients."
    },
    {
      "id": 2,
      "content": "So in a large bowl combine two cups of all-purpose flour, a teaspoon of baking powder, half a teaspoon of baking soda, and a quarter teaspoon of salt Then whisk it all together and reserve one tablespoon of that flour mixture",
      "label": "Prepare Dry Ingredients",
      "explanation": "This segment details the combination and preparation of all dry ingredients essential for the muffin batter."
    },
    {
      "id": 3,
      "content": "You'll also need 2 teaspoons of baking powder, and 1/2 teaspoon of salt. This is also the point where you'd add in any spices like cinnamon or pumpkin pie spice. We're gonna give this a quick mix just to combine, about 10 seconds.",
      "label": "Prepare Dry Ingredients",
      "explanation": "This segment involves preparing and mixing the dry ingredients, including baking powder, salt, and optional spices. It represents the step of readying these components before combining with wet ingredients."
    },
    {
      "id": 4,
      "content": "now sifting the flour with baking powder and a pinch of salt",
      "label": "Prepare Dry Ingredients",
      "explanation": "This step involves sifting together the flour, baking powder, and salt, which are the dry ingredients for the muffins."
    }
  ],
  "Step3": [
    {
      "id": 0,
      "content": "this was melted a minute ago it already cooled down i'm going to put it into the microwave for the wet ingredients it's important that you're dealing with room temperature things and if it gets cold we're going to warm it up in the microwave and ps it's going to get cold this counter is freezing all right 300 ml or 1 4 cups of whole milk in yoga half a cup or 113 grams of unsalted butter that's been melted and get it all out there so by the by today is the first time ever in the history of preppy kitchen that brian is filming you wanna say hi no he's eating cookies that i made one cup or 200 grams of sugar right in that bowl let's give it a whisk to bring it together if you notice some clumps of butter happen when you mix it all together pop it into the microwave for 40 seconds and it should be totally fine i used warm milk so it's not happening to me so right now we're gonna add in the eggs and the sour cream two large eggs one two as well as one quarter cup of sour cream and if you don't have that you can go ahead and use full fat plain yogurt it'll be completely delicious still this is optional but i am adding one tablespoon of vanilla that's 15 ml",
      "label": "Prepare Wet Ingredients",
      "explanation": "This step involves preparing and mixing all the wet ingredients, including warming them to the right temperature to ensure a smooth mix."
    },
    {
      "id": 1,
      "content": "add all the wet ingredients to a bowl and whisk until combined",
      "label": "Prepare Wet Ingredients",
      "explanation": "This part of the narration covers combining all wet ingredients, which fits the step of preparing wet ingredients."
    },
    {
      "id": 2,
      "content": "Now add three eggs into a large bowl and whisk them on high speed using an electric mixer You want to do this for about three minutes until the eggs become fluffy and pale Then continue beating the eggs as you slowly add one cup of granulated sugar You'll want to keep beating those eggs for about three more minutes... Now you want to add a teaspoon of vanilla extract and a tablespoon of fresh lemon juice Now continue beating the egg mixture as you slowly add 3/4 cups of heavy cream",
      "label": "Prepare Wet Ingredients",
      "explanation": "This segment outlines the process of preparing the wet ingredients, which includes beating the eggs until fluffy, then gradually adding sugar, vanilla extract, lemon juice, and heavy cream."
    },
    {
      "id": 3,
      "content": "The batter starts with 1/2 cup of softened salted butter, and 1 cup of granulated sugar. We're going to use a hand mixer to cream this together. At first this mixture will be lumpy, but keep on mixing for about 2 minutes. After 2 minutes your sugar and butter will be well combined, and it'll be a smooth, paste-like, creamy consistency. Then you'll add in 2 large eggs, and mix this briefly until just combined, about 30 seconds. Then I'm going to add in 1 teaspoon of vanilla extract, or you can use other flavors of extract, like almond extract, orange extract, lemon extract.",
      "label": "Prepare Wet Ingredients",
      "explanation": "This segment captures the preparation of the wet ingredients, from creaming butter and sugar to incorporating eggs and flavor extracts, which are foundational steps before combining with dry ingredients."
    },
    {
      "id": 4,
      "content": "to a large mixing bowl add grated lemon zest a milk of choice we're using soy milk sugar a neutral vegetable oil and vanilla extract we squel until the ingredients are well combined",
      "label": "Prepare Wet Ingredients",
      "explanation": "This segment covers the combination of wet ingredients, including the lemon zest, soy milk, sugar, vegetable oil, and vanilla extract."
    }
  ],
  "Step4": [
    {
      "id": 0,
      "content": "now it's time to pour the wet into the dry give it a whisk and take it to almost combined you could have a couple clumps of like flour hanging out here and there because we'll do more mixing once those chocolate chips go in so you can see we have a couple clumps here and there but it's no big deal",
      "label": "Combine Wet and Dry Ingredients",
      "explanation": "This segment covers combining the wet and dry ingredients to form the muffin batter, emphasizing not to overmix."
    },
    {
      "id": 1,
      "content": "fold the wet ingredients into the mix",
      "label": "Combine Wet and Dry Ingredients",
      "explanation": "This segment describes the action of mixing the wet and dry ingredients together, aligning with the step of combining wet and dry ingredients."
    },
    {
      "id": 2,
      "content": "Now you can begin adding your dry ingredients, but don't do it all at once So get a sifter out and then add about a third of that flour mixture at a time with mixing in between... Once you've got all of your dry ingredients well combined into the muffin batter",
      "label": "Combine Wet and Dry Ingredients",
      "explanation": "This part of the narration describes the gradual combination of wet and dry ingredients to form the muffin batter."
    },
    {
      "id": 3,
      "content": "Now at this point it's time to ditch our hand mixer and grab a rubber spatula. Add in half of your all-purpose flour. You're going to use 2 cups total, so you're going to add in 1 cup right now. Then use the rubber spatula to stir this in. Once all those white specks of flour start to disappear, you'll pour in 1/2 cup of either milk or buttermilk. And you'll stir this in as well until it's well combined. Last you'll add in the remaining 1 cup of all-purpose flour.",
      "label": "Combine Wet and Dry Ingredients",
      "explanation": "In this segment, the process of combining the wet and dry ingredients is described, highlighting the methodical addition and mixing to achieve a consistent batter."
    },
    {
      "id": 4,
      "content": "whisk wet and dry ingredients for a short minute until lumps are gone but without over mixing",
      "label": "Combine Wet and Dry Ingredients",
      "explanation": "After preparing the wet and dry ingredients separately, this step involves combining them together with careful mixing to avoid overmixing."
    }
  ],
  "Step5": [
    {
      "id": 0,
      "content": "it's time for some chocolate the best part all right in my recipe i specify one and a half cups of semi-sweet chocolate but i'm living large and using one cup of semi-sweet and half a cup of bittersweet you could even use milk chocolate if that's what you prefer here we go that's the bittersweet chocolate and i'm taking a handful of the semi-sweet chips and reserving them because i'll be sprinkling them on top for beauty purposes rest of the chocolate chips go in and you should fold them in with a spatula not use a whisk",
      "label": "Add Add-ins",
      "explanation": "This part is about adding the chocolate chips into the batter, a crucial step for flavor and texture."
    },
    {
      "id": 1,
      "content": "then add your chocolate chips coating them in the flour help stop them from sinking",
      "label": "Add Add-ins",
      "explanation": "The narration segment about adding chocolate chips into the dry ingredients before combining with wet ingredients fits this step, as it details incorporating add-ins into the batter."
    },
    {
      "id": 2,
      "content": "Now mix that reserve tablespoon of the flour mixture with one-and-a-half cups of fresh blueberries... Now the last and final step is adding in those blueberries and at this point you want to fold it in with a spatula",
      "label": "Add Add-ins",
      "explanation": "This segment explains coating the blueberries with flour to prevent them from sinking, and then folding them into the batter as an add-in."
    },
    {
      "id": 3,
      "content": "Now if you're gonna add anything into your muffins, like dried fruit, chocolate chips, or berries, now would be the time to do so.",
      "label": "Add Add-ins",
      "explanation": "This part of the narration introduces the optional step of adding mix-ins into the batter, allowing for customization of the muffins."
    },
    {
      "id": 4,
      "content": "rinse the blueberries shake the water off then add them to a bowl toss them with a cornstarch and add them to the batter stir and fold the blueberries in the mixture gently",
      "label": "Add Add-ins",
      "explanation": "This segment describes preparing the blueberries by rinsing and coating them with cornstarch before folding them into the batter, which prevents them from sinking."
    }
  ],
  "Step6": [
    {
      "id": 0,
      "content": "i'm doing it two different ways so you can see the difference between a naked muffin and one that's in the paper it's gonna be different i've buttered and floured half of the muffin tins so you can see just a nice cut of butter good dash of flour move all that flour around and then dump out the excess all right and for the rest i'm going to use muffin papers which go a bit higher so you won't have that like mushroom shaped muffin top but they should still rise up with a nice dome",
      "label": "Prepare Muffin Tins",
      "explanation": "This segment describes preparing the muffin tins either by buttering and flouring for a crisp edge or using muffin papers, showcasing different outcomes."
    },
    {
      "id": 1,
      "content": "",
      "label": "Prepare Muffin Tins",
      "explanation": "The narration does not specify how the muffin tins were prepared, so this step is left empty."
    },
    {
      "id": 2,
      "content": "Now line your muffin tin with cupcake liners",
      "label": "Prepare Muffin Tins",
      "explanation": "The narration specifies preparing the muffin tin by lining it with cupcake liners for baking."
    },
    {
      "id": 3,
      "content": "Then line a 12 cup muffin tin with paper baking cups. Then I like to give mine just a spritz of nonstick cooking spray, right on those paper baking cups, to prevent the muffins from sticking.",
      "label": "Prepare Muffin Tins",
      "explanation": "This segment describes preparing the muffin tins with paper baking cups and nonstick cooking spray, essential for easy muffin removal post-baking."
    },
    {
      "id": 4,
      "content": "",
      "label": "Prepare Muffin Tins",
      "explanation": "The narration does not explicitly mention preparing the muffin tins, but it is implied in the context of transferring the batter to the muffin liners."
    }
  ],
  "Step7": [
    {
      "id": 0,
      "content": "i'm using a large ice cream scooper to transfer my batter into the muffin tin and i want to fill it up all the way normally it's two-thirds of the way high for cupcakes but this time it's full to the brim okay fill those papers up and when you're doing that try to be careful about getting like batter on the edges it'll burn it's just a matter of how it looks it'll still bake fine when you're scooping the batter it's a nice time to kind of monitor the chocolate chips and make sure that no one is getting a sad amount you want to have an equal distribution so if you notice that your scoop didn't get any chips scoop up some chips after the batter goes in",
      "label": "Fill Muffin Tins",
      "explanation": "This step focuses on filling the muffin tins to the top for the desired dome effect and ensuring even distribution of chocolate chips."
    },
    {
      "id": 1,
      "content": "scoop the batter into muffin cases",
      "label": "Fill Muffin Tins",
      "explanation": "This part of the narration directly corresponds to filling the muffin tins with batter."
    },
    {
      "id": 2,
      "content": "begin scooping the batter out using a large cookie scoop. I Like to top my blueberry muffins with a few extra blueberries on top, but that's totally optional",
      "label": "Fill Muffin Tins",
      "explanation": "This part describes filling the prepared muffin tins with batter and optionally topping it with additional blueberries."
    },
    {
      "id": 3,
      "content": "We're gonna divide the batter up amongst our 12 muffin cups, and you should fill each one about 2/3 of the way full.",
      "label": "Fill Muffin Tins",
      "explanation": "Here, the action of dividing the batter among the muffin cups is detailed, including how much to fill each cup to ensure proper rising."
    },
    {
      "id": 4,
      "content": "transfer the batter to the muffin liners you should be able to make 12 muffins you can fill them almost to the top",
      "label": "Fill Muffin Tins",
      "explanation": "This step involves filling the prepared muffin tins with batter, indicating the quantity and how much to fill each liner."
    }
  ],
  "Step8": [
    {
      "id": 0,
      "content": "this recipe makes exactly 12 big muffins and now it's time to go into the oven you need to have a high heat to lock in the edge so it gets set and then the top can burst through to create that big bakery style dome this is gonna go into the oven at 425 fahrenheit for five minutes then we'll reduce the temperature to 350 and bake for 20 to 25 minutes depending you want to have a nice golden top that's set in the middle so you can insert a skewer through the center and it'll come out clean except for all that molten chocolate",
      "label": "Bake",
      "explanation": "This part of the narration details the baking process, including the initial high heat to set the muffins' edges and the temperature reduction to cook through."
    },
    {
      "id": 1,
      "content": "follow these bacon instructions",
      "label": "Bake",
      "explanation": "Although the specific baking temperature and time are not mentioned, this segment indicates the baking process."
    },
    {
      "id": 2,
      "content": "bake them in the oven at 350 degrees Fahrenheit for about 35 minutes",
      "label": "Bake",
      "explanation": "The segment clearly mentions the baking temperature and duration necessary for the muffins."
    },
    {
      "id": 3,
      "content": "Bake your muffins in the 425 degree oven for 7 minutes. After 7 minutes reduce the temperature on your oven to 350 degrees without opening the oven door. Continue baking for 12-15 minutes, and watch them carefully, as the cooking time will vary a little bit depending on your oven.",
      "label": "Bake",
      "explanation": "This part outlines the specific baking instructions, including an initial high-temperature bake followed by a reduced temperature to finish baking, which is crucial for achieving the desired muffin texture."
    },
    {
      "id": 4,
      "content": "then baking a preheated oven for 22 and a half minutes or until a toothpick inserted in the center comes out dry",
      "label": "Bake",
      "explanation": "This segment gives the baking time and method for checking doneness, which aligns with the baking step."
    }
  ],
  "Step9": [
    {
      "id": 0,
      "content": "out of the oven and cooled just enough touch i want to show you the difference between the in paper versus the out of paper out of paper so nice crisp edge muffin over a little bit and golden brown in the paper the paper really guided it up so it's a little bit taller and the difference is that you don't have that crisp edge it's really like soft all over and just delicious you've got to take a look at the inside of this",
      "label": "Cool and Serve",
      "explanation": "This segment contrasts the final appearance and texture of the muffins based on the baking method, followed by cooling and serving."
    },
    {
      "id": 1,
      "content": "",
      "label": "Cool and Serve",
      "explanation": "Cooling and serving of the muffins are not described in the narration, hence left empty."
    },
    {
      "id": 2,
      "content": "",
      "label": "Cool and Serve",
      "explanation": "The narration doesn't explicitly mention cooling the muffins before serving, but it is a standard practice in baking."
    },
    {
      "id": 3,
      "content": "",
      "label": "Cool and Serve",
      "explanation": "The original narration does not explicitly describe a cooling step post-baking, but it's an implied part of the process before serving."
    },
    {
      "id": 4,
      "content": "now let them cool down for about 30 minutes",
      "label": "Cool and Serve",
      "explanation": "After baking, this step involves letting the muffins cool down for a specified time before serving."
    }
  ],
  "Step10": [
    {
      "id": 0,
      "content": "",
      "label": "Additional Preparations",
      "explanation": "This step does not apply to the provided narration as there were no additional or unique preparation steps beyond the standard muffin-making process outlined."
    },
    {
      "id": 1,
      "content": "then refrigerate for at least one hour this helps them rise without overflowing",
      "label": "Additional Preparations",
      "explanation": "Refrigerating the batter before baking is a unique step mentioned in the narration, aligning with additional preparations not commonly found in other muffin recipes."
    },
    {
      "id": 2,
      "content": "And before the muffins go into the oven you want to make that simple streusel. In a small bowl combine a 1 tablespoon of unsalted cold cubed butter, 2 tablespoons of all-purpose flour, a pinch of salt, a teaspoon of cinnamon, and 3 tablespoons of brown sugar Mash that all together using a fork until the ingredients are well combined and they have a crumbly texture to them Now top the blueberry muffins with the streusel topping",
      "label": "Additional Preparations",
      "explanation": "This segment describes the preparation of a brown sugar streusel topping for the muffins, adding an additional texture and flavor."
    },
    {
      "id": 3,
      "content": "One fun topping you can experiment with is sprinkling on about 1 teaspoon of granulated sugar on top of your muffins. This gives it a nice little crunchy sweet top.",
      "label": "Additional Preparations",
      "explanation": "This segment introduces an optional step for enhancing the muffins with a sugar topping for added texture, showcasing an additional preparation method not included in the basic steps."
    },
    {
      "id": 4,
      "content": "",
      "label": "Additional Preparations",
      "explanation": "There are no additional preparation steps mentioned in this particular narration that don't already fit into the identified common steps."
    }
  ]
}